LinkedFolderNEW/TrainSet60G41U3_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points(16);
        points[0]  = point(0, 0, 0.5);
        points[1]  = point(25.5, 0, 0.5);
        points[2]  = point(25.5, 12.7, 0.5);
        points[3]  = point(0, 12.7, 0.5);
        points[4]  = point(5, 5, 0.5);
        points[5]  = point(6, 5, 0.5);
        points[6]  = point(6, 6, 0.5);
        points[7]  = point(5, 6, 0.5);
        points[8]  = point(5, 0, 0.5);
        points[9]  = point(6, 0, 0.5);
        points[10] = point(25.5, 5, 0.5);
        points[11] = point(25.5, 6, 0.5);
        points[12] = point(6, 12.7, 0.5);
        points[13] = point(5, 12.7, 0.5);
        points[14] = point(0, 6, 0.5);
        points[15] = point(0, 5, 0.5);

        // Duplicate z points
        label sz = points.size();
        points.setSize(2*sz);
        for (label i = 0; i < sz; i++)
        {
            const point& pt = points[i];
            points[i+sz] = point(pt.x(), pt.y(), -pt.z());
        }

        os  << points;
    #};
};


blocks
(
    hex (16 24 20 31 0 8 4 15) (20 20 1) simpleGrading (1 1 1)
    hex (24 25 21 20 8 9 5 4) (10 20 1) simpleGrading (1 1 1)
    hex (25 17 26 21 9 1 10 5) (20 20 1) simpleGrading (1 1 1)
    hex (21 26 27 22 5 10 11 6) (20 10 1) simpleGrading (1 1 1)
    hex (22 27 18 28 6 11 2 12) (20 20 1) simpleGrading (1 1 1)
    hex (23 22 28 29 7 6 12 13) (10 20 1) simpleGrading (1 1 1)
    hex (30 23 29 19 14 7 13 3) (20 20 1) simpleGrading (1 1 1)
    hex (31 20 23 30 15 4 7 14) (20 10 1) simpleGrading (1 1 1)
);

edges
(

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 15 31 16)
            (15 14 30 31)
            (14 3 19 30)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (17 26 10 1)
            (26 27 11 10)
            (27 18 2 11)

            (3 13 29 19)
            (13 12 28 29)
            (12 2 18 28)

            (0 16 24 8)
            (8 24 25 9)
            (1 9 25 17)
        );
    }
    upAndBottom
    {
        type empty;
        faces
        (
            (3 14 7 13)
            (14 15 4 7)
            (15 0 8 4)
            (4 8 9 5)
            (5 9 1 10)
            (6 5 10 11)
            (12 6 11 2)
            (13 7 6 12)

            (19 29 23 30)
            (30 23 20 31)
            (31 20 24 16)
            (20 21 25 24)
            (21 26 17 25)
            (22 27 26 21)
            (28 18 27 22)
            (29 28 22 23)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (7 4 20 23)
            (4 5 21 20)
            (5 6 22 21)
            (6 7 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
